
error=-1001761055456

#QIWI-токен
#____________________________________#
qiwi_token=''
#____________________________________#
#BOT-токен
#____________________________________#
bot_token=''
#____________________________________#
#ID каналов для отправки сообщений
#____________________________________#
balance=-1001634447019 #канал, который уведомляет о покупках
pokupka=-1001770076535 #канал, который уведомляет о пополнении баланса
error=-1001761055456 #канал, который уведомляет об ошибках
#____________________________________#
#Приветственная картинка:
#____________________________________#
image_link='https://i.ibb.co/qNqNL1V/tetstvaa.jpg'
image_name='bot.png'
#____________________________________#
#Логин канала, где проверить подписку:
#____________________________________#
channel_popdiska='@end_soft'
#____________________________________#
techpod='https://t.me/end_soft'

otzyv_channel='https://t.me/end_soft'

ref='https://t.me/end_soft?start='