# from db import Database
# db = Database()

#----------------------------------------------------------------------------------------------------------------

# Token бота
TOKEN = "Тут ваш токен"
#----------------------------------------------------------------------------------------------------------------

# ID на аккаунт админа
admins = [
	# айди админов

]

#----------------------------------------------------------------------------------------------------------------

# Каналы на каторые нужно быть подписанными ['Имя, которое будет выводиться на кнопке', 'ID канала', 'ссылка на канал']
# Бот должен быть админом в этих каналах, чтобы проверить наличие подписки
CHANNELS = [
	# каналы, на которые нужно будет подписаться

]

#----------------------------------------------------------------------------------------------------------------

# Сообщение которое будет выводиться если не подписал на какой-то канал
NOT_SUB_MESSAGE = 'Вы не подписаны на канал!'


#----------------------------------------------------------------------------------------------------------------
#----------------------------------------------------------------------------------------------------------------

# bot_name = 'SearchGamingFriendBot'


# def generate_referral_link(user_id):
#     return f"http://t.me/{bot_name}?start={user_id}"
